Revit 2027 API
BuiltInFailures.ViewSheetFailures.ViewInAModelMustBeUniqueWarn Property
 Sheet views in this model cannot contain more than one instance of "%1!s!."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ViewInAModelMustBeUniqueWarn { get; }
Public Shared ReadOnly Property ViewInAModelMustBeUniqueWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ViewInAModelMustBeUniqueWarn {
	FailureDefinitionId^ get ();
}
static member ViewInAModelMustBeUniqueWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ViewSheetFailures Class
Autodesk.Revit.DB Namespace